app/controllers/categorias_controller.rb

SELECT "categorias".* FROM "categorias"
---
  def index
    @categorias = Categoria.all