app/controllers/comunas_controller.rb

  def index
    @comunas = Comuna.all
---
SELECT "comunas".* FROM "comunas"

    def set_comuna
      @comuna = Comuna.find(params[:id])
---
SELECT  "comunas".* FROM "comunas"  WHERE "comunas"."comuna_id" = $1 LIMIT 1  [["comuna_id", 13101]]