app/controllers/contratos_controller.rb

SELECT "contratos".* FROM "contratos"
---
  def index
    @contratos = Contrato.all

SELECT "slas".* FROM "slas"
---
  def new
    @contrato = Contrato.new

    @all_slas= Sla.all

INSERT INTO "calidades" ("contrato_id", "created_at", "sla_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "calidad_id"  [["contrato_id", 3], ["created_at", "2015-10-15 18:45:24.690393"], ["sla_id", 1], ["updated_at", "2015-10-15 18:45:24.690393"]]
INSERT INTO "contratos" ("clausulaTermino", "comision", "contrato_id", "created_at", "descripcion", "evalucion", "fechaFin", "fechaInicio", "nombre", "prestador", "updated_at", "valorservicio") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "contrato_id"
---
  def create
    @contrato = Contrato.new(contrato_params)

     params[:slas][:sla_id].each do |sla|
        if !sla.empty?
           @contrato.calidades.build(:sla_id => sla)
        end
    end

    respond_to do |format|
      if @contrato.save

SELECT  "contratos".* FROM "contratos"  WHERE "contratos"."contrato_id" = $1 LIMIT 1  [["contrato_id", 4]]
---
    def set_contrato
      @contrato = Contrato.find(params[:id])