app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT "empresas".* FROM "empresas"