app/controllers/experiencias_controller.rb

SELECT "experiencias".* FROM "experiencias"
---
  def index
    @experiencias = Experiencia.all

INSERT INTO "experiencias" ("cargo", "created_at", "descripcion", "empresa", "fechaFin", "fechaInicio", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "idExperiencia"
---
  def create
    @experiencia = Experiencia.new(experiencia_params)

    respond_to do |format|
      if @experiencia.save