app/controllers/laborales_controller.rb

  def index
    @laborales = Laboral.all
---
SELECT "laborals".* FROM "laborals"