app/controllers/permisos_controller.rb

  def index
    @permisos = Permiso.all
---
SELECT "permisos".* FROM "permisos"