app/controllers/pruebas_controller.rb

  def index
    @pruebas = Prueba.all
---
SELECT "pruebas".* FROM "pruebas"