app/controllers/slas_controller.rb

  def index
    @slas = Sla.all
---
SELECT "slas".* FROM "slas"

  def create
    @sla = Sla.new(sla_params)

    respond_to do |format|
      if @sla.save
---
INSERT INTO "slas" ("activo", "created_at", "descripcion", "nombre", "porcentajeImportacia", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "SLA_id"  [["activo", "1"], ["created_at", "2015-10-07 04:05:09.706946"], ["descripcion", "sdfas"], ["nombre", "sfdas"], ["porcentajeImportacia", 19], ["updated_at", "2015-10-07 04:05:09.706946"]]

  def update
    respond_to do |format|
      if @sla.update(sla_params)
---
UPDATE "slas" SET "calidad_id" = $1, "updated_at" = $2 WHERE "slas"."SLA_id" = 1  [["calidad_id", 1], ["updated_at", "2015-10-07 04:05:35.072424"]]

  def destroy
    @sla.destroy
---
DELETE FROM "slas" WHERE "slas"."sla_id" = $1  [["sla_id", 18]]

    def set_sla
      @sla = Sla.find(params[:id])
---
SELECT  "slas".* FROM "slas"  WHERE "slas"."sla_id" = $1 LIMIT 1  [["sla_id", 18]]