app/controllers/socios_controller.rb

  def index
    @socios = Socio.all
---
SELECT "socios".* FROM "socios"