app/controllers/telefonos_controller.rb

  def index
    @telefonos = Telefono.all
---
SELECT "telefonos".* FROM "telefonos"