app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("apellido", "claveUsuario", "correo", "created_at", "direccion_id", "facebook", "fechaNacimiento", "genero", "linkedin", "nombre", "nombreUsuario", "telefono_id", "twitter", "updated_at", "usuario_id", "youtube") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "usuario_id"
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE "usuarios" SET "apellido" = $1, "claveUsuario" = $2, "correo" = $3, "nombre" = $4, "nombreUsuario" = $5, "updated_at" = $6 WHERE "usuarios"."usuario_id" = 1  [["apellido", "Carcamo"], ["claveUsuario", "asdfasdf"], ["correo", "JulianCarcamo@asgar.pk"], ["nombre", "Julian"], ["nombreUsuario", "JulianCarcamo"], ["updated_at", "2015-10-15 20:58:42.736078"]]
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."usuario_id" = $1 LIMIT 1  [["usuario_id", 1]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])